import pandas as pd

In [1]:
import pandas as pd

In [2]:
#TEST

print("hello")

hello

Intro to DATAFRAMES

it is a main data structure of python pandas library, we can assume dataframes as all sorts of tables with extra functionality

In [92]:
#declaring a data frame
#with values and with number of coloumns
df = pd.DataFrame([[1,2,3,0], [4,5,6], [7,8,9]], columns=["A", "B", "C", "D"], index=["a", "b", "c"])

In [93]:
#Calling WHole dataframe
df.head()

   A  B  C    D
a  1  2  3  0.0
b  4  5  6  NaN
c  7  8  9  NaN

In [94]:
#Calling single row
df.head(1)

   A  B  C    D
a  1  2  3  0.0

In [95]:
#Calling two rows
df.head(2)

   A  B  C    D
a  1  2  3  0.0
b  4  5  6  NaN

In [96]:
#Calling zero rows
df.head(0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [97]:
#To call bottom rows
df. tail(2)

   A  B  C   D
b  4  5  6 NaN
c  7  8  9 NaN

In [98]:
#calling whole dataframe
df

   A  B  C    D
a  1  2  3  0.0
b  4  5  6  NaN
c  7  8  9  NaN

In [99]:
df.columns #To see only headers

Index(['A', 'B', 'C', 'D'], dtype='object')

In [100]:
df.columns.tolist()

['A', 'B', 'C', 'D']

In [101]:
df.index #To see only indexes

Index(['a', 'b', 'c'], dtype='object')

In [102]:
df.index.tolist()

['a', 'b', 'c']

In [103]:
# To see information of DataFrame
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, a to c
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
 2   C       3 non-null      int64
 3   D       1 non-null      float64
dtypes: float64(1), int64(3)
memory usage: 120.0+ bytes

In [104]:
# Describes the Dataframe
df.describe()

         A    B    C    D
count  3.0  3.0  3.0  1.0
mean   4.0  5.0  6.0  0.0
std    3.0  3.0  3.0  NaN
min    1.0  2.0  3.0  0.0
25%    2.5  3.5  4.5  0.0
50%    4.0  5.0  6.0  0.0
75%    5.5  6.5  7.5  0.0
max    7.0  8.0  9.0  0.0

In [105]:
# To filterize aas to see unique 
df.nunique()

A    3
B    3
C    3
D    1
dtype: int64

In [106]:
# To bind to see unique 
df["A"].nunique()

3

In [107]:
df["A"].unique()

array([1, 4, 7])

In [108]:
#Which gives the shape of DataFrame
df.shape

(3, 4)